def goods_analysis(*args, in_sale=lambda x: "молоко" in x["название"].lower()):
    args = filter(lambda x: x['количество'] > 0, args)
    return (sorted(filter(in_sale, args), key=lambda x: x['цена'])[:3])


if __name__ == '__main__':
    p1, p2, p3 = goods_analysis(
        {'название': 'Молоко Бурёнка 0,5л', 'цена': 50, 'количество': 100},
        {'название': 'Молочный шоколад Праздник', 'цена': 50,
         'количество': 99},
        {'название': 'Деревенское молоко, бутылка 2л', 'цена': 100,
         'количество': 13},
        {'название': 'МОЛОКО ГОСТ', 'цена': 65, 'количество': 1}
    )
    print(*sorted([p1, p2, p3], key=lambda x: x['название']), sep='\n')
